[
    {
        "thread_name": "Pathfinder, let's just get to the point",
        "init_post": "Is it easy? You bet and that’s the actual problem. (Inb4 developer takes this out of context.)It’s tedious just to grind the reputation. I actually like pathfinder. I like the fact you need to explore the zone, do the quests, and stuff. It makes complete and utter sense. That the fun part - reading the new story, exploring new vistas.Revered grind? Boring and tedious. Sure it’s easy, sure you can do it within a month  or two. Sure you should have it do done before part 2 comes out.But that doesn’t change the fact it’s a tedious chore in a game where a lot of the systems including artifact, sorry azerite power is also added onto this as well reputation grinds to continue the war campaign.World quests are not fun. They’re boring after a week or two and doesn’t make the game interesting. Reputation farming is a tedious chore and unless something is done to bring upon a reputation farming system that is actually engaging and fun.We will keep having this dumb discussion."
    },
    {
        "thread_name": "Are Blood Elves the most selfish race?",
        "init_post": "At least Orcs and all can point to “YO it be demon blood yo we be cool now” etc etc. and Undead can say “Yo we were bribed by the LK for free drinks if we pretended to be his meat walls” but Blood Elves are just another level.They’re the original Elves who overdosed on the Well of Eternity and are responsible for the Legion discovering Azeroth.Then they throw a tantrum when told that it’s dangerous to use Magic and move away from sensible stuff and create their own doom by overdosing again on their Sunwell.Conveniently hold back from sending a defense force when the original Alliance is being pwned by Trolls and send a small force led by Alleria. Despite having a obligation due to a treaty of sorts.Then cry loud about how it’s so unfair that no one is defending them when the Trolls decide to “LUL let’s now massacre these dudes instead!”Some of them still don’t get over their addiction to magic despite all the silly stuff they’ve done and manipulate a Naa’ru, their leader goes to fel in his addiction.They still try to help Garrosh with the Divine Bell when some of their kind is trying to rejoin the Alliance. That’s some next level of trolling in their own face.There may be some stuff I left out but the only things which you can empathize for are: Garithos and Jaina’s attempted purge.Even Garithos seemed to have held a grudge because of said Blood Elves not defending the Alliance and his family got massacred by Trolls.Jaina was probably justified in ending their eternal stupidity of repeating the same mistakes to satisfy their own ends regardless of the other people."
    },
    {
        "thread_name": "Why all the hostility?",
        "init_post": "So, I’ve not been on the forums that long. I recently started reading and posting during lull moments at work. I agree that there is a major problem now. The hostility in the community, and Blizz apparently lack of connection with the community. Here’s looking at you, “Don’t you guys have phones?” That being said, yes pun intended, I realize that we are all passionate about Blizz, I’ve been on the game off and on since the beginning of classic wow, but all the name calling and fighting among ourselves does no good.I am heart-broken over the direction of the game, I won’t deny that. However, I don’t believe in name calling others, trolling others, or causing a mess.TLDR: Can’t we discuss things and disagree on things civilly?? Just sayin…"
    },
    {
        "thread_name": "Really upset I don't get the Night Warrior look",
        "init_post": "What is going on here. I am a night elf and I don’t get the Night Warrior look because of my CLASS?!?!? IN customization, there is a look of no blind-fold, with green glowing eyes. Some helms make my eyes dark yellow. And now I am somehow NOT a night elf because of being a DH?This is too much Blizzard. No logic, just random and uncaring.My main is a NE DH. Now I need to re-roll some other character just to enjoy the Night Warrior customization because you don’t recognize me as a Night Elf anymore? Well, in that case , I am beginning to hate you."
    },
    {
        "thread_name": "LFR Is More Fun Than Normal Raiding",
        "init_post": "I’ve been running LFR on a couple of alts for the Jaina mount and I have to say it’s been fun running them. The mechanics are still engaging and challenging enough that you have to pay attention or it could mean a wipe. There’s no stress from not maxing your performance,  you can have some fun in chat, and people are more laid back while progressing through the raid.Normal pug raiding is a headache, especially when you’re dealing with toxic raid leaders that kick anyone for sneezing. Bad groups lead to pug hopping all the time since everyone leaves after 1 wipe or raid leader doesn’t know where the problem lies so lowest dps is the first to go then we wipe again because of mechanics.Overall, I feel that LFR is superior to high difficulty raiding and I suggest you add Heroic and Normal difficulty to LFR for those of us that want to avoid the headache of the crazy group finder people.Would you use LFR to get into normal or heroic raiding?"
    },
    {
        "thread_name": "A title you get from Nazjatar needs to be changed",
        "init_post": "A title you can get is _____ of the Deeps.Doesn’t sound rightShould be1.) Of the Deep2.) Of the DepthsHardly anyone uses deeps anymore plus deep just rolls of the tongue better"
    },
    {
        "thread_name": "250k plus waiting in que",
        "init_post": "I just tried to log into every realm and I added up the number of people in que… Its just under 250k people in que. Unreal ."
    },
    {
        "thread_name": "Dear Blizzard, Please Fix My Bag Space",
        "init_post": "Hi Blizzard,I think it’s cool that you guys are trying to add new and exciting items to the game.  Unfortunately I’m here to report that my bags just don’t like it.  They are constantly getting full with the gear I need keep for my offspecs, consumables, and now all these crazy items I will rarely, if ever, use.  Maybe try something like making spare parts a currency? Maybe allow items to stack in higher quantities? However you do it my bags will certainly appreciate it.Sincerely,My Bags"
    },
    {
        "thread_name": "Ending subscription because",
        "init_post": "Blizzard is proving to be extremely ignorant and not listening to the playerbase on a multitude of issues.Portal Removal: Blizzard should have kept the portals where they were and implemented a portal room not striping them away from us.Avoiding Q&amp;A questions: Devs have constantly avoided questions or showed their complete incompetence on many issues at hand such as “What is fun”, no Ion doing mythic+ on lower keystones doesn’t mean we are having fun it means we are alleviating unnecessary RNG grind for friends/guildies.Gearing: As said in the Q&amp;A more sources of gear does not mean good quality gear nor the acquisition of the gear.And many more. This is why I am ending my subscription."
    },
    {
        "thread_name": "Serious Suggestion: WoW needs a DPS-only Dungeon Queue",
        "init_post": "Devs, players, hear me out.DPS queues often take upward of half an hour, due to the ratio of players who are willing to tank/heal versus those that are not. And I genuinely think that the closest the game can come to a solution for this is to create a new kind of dungeon queue that doesn’t require a tank or healer at all.For the sake of this conversation, lets call them  (due to the increasingly chaotic nature of a dungeon where tanks/heals are absent). They’d be available in Normal and Heroic (I’m excluding Mythic/M+ since you can’t queue for those regardless) and drop the same loot as Normal/Heroic dungeons.Upon entering the queue screen, you see a new option: Chaos Dungeons. Out of curiosity you click on it, and a large DISCLAIMER appears.“”From here you actually have to click ‘Yes’ to advance to the queue - that way nobody can say “I didn’t know what I was getting into!”The idea is that the presence of 2 extra damage-dealers could largely compensate for the lack of control that a tank provides, but also make mechanics more relevant than ever as a dps won’t always have the means to survive the stuff a tank can withstand. So interrupts, moving, etc would still matter. And perhaps there could be buffs scattered throughout that players could pick up, like we see in Battlegrounds… they could reduce damage taken, regenerate health, etc.I honestly think this kind of thing could help alleviate the stress of dps classes/specs spending so much time WAITING to do the content they’re trying to do.Thoughts?"
    },
    {
        "thread_name": "Ever Herp So Hard That You Derped?",
        "init_post": "Just used the flight master’s whistle right next to the flightmaster. Then hearthed because I forgot why I came to the zone."
    },
    {
        "thread_name": "Your Lore Tinfoil Hat Theories",
        "init_post": "I believe that the Nightborne joined the Horde not because Tyrande rejected them or because Liadrin befriended them, but because they were interested in… the Forsaken!Evidence:What about you? Do you have any Tinfoil Hat theories about WoW’s lore? "
    },
    {
        "thread_name": "Tidalcore is not a 100% drop from M+ LOL",
        "init_post": "It’s my own fault, really. I don’t know what I expected from you Blizzard. You do so many obvious things to string people along. I don’t know why I thought this would be different. What a pain. Can we, just for once, have a system where you do x and get y? This is completely turning me off to your game."
    },
    {
        "thread_name": "We Need TBC/WotLK Server(s)",
        "init_post": "Wow’s subscriptions peaked just at the end of WotLK just before Cataclysm launched.With Classic’s success there will be even more potential people that want to play TBC and WotLK again.A timeline and whether or not transfers would be allowed to a fresh server would help people decide how much time to invest in Classic.Until we know more I don’t really want to invest in more than one character. It’s far too much time to invest leveling a character that I may or may not use for years to come."
    },
    {
        "thread_name": "8.1 isn't enough",
        "init_post": "I’ve explored the content on the PTR, heard and kept up with the latest news and changes. But let’s be honest here, it’s just not enough to reinvigorate this expansion.Blizzard seems keen to double down and attempt to make the mundane - the focal of this expansion. Look at world quests - they’ve added paragon rep, however, no mounts; Warfronts? New one - looks fun, but only for first time around, then let’s be honest again - you’ll all afk it. New Raid? Time-gated, won’t be out on release. Heritage Armour - amazing, however only 1 hour of content to complete both Dwarf and Blood Elf. Incurssions - were actually fun, however get boring quick, and will only be used to level alts. Leveling changes, massive improvement - don’t know why they had to nerf it in the first place. War Campaign? some cool lore bits, but it’s really not going to be sweeping content. Remastered bgs? Cool, but it’s still old content. Island Expo’s, yet again people generally don’t like doing these - they’re tedious. It took nearly double the time for this patch to come out in comparison to 7.1 in Legion - only to arguably deliver less in terms of content. This is unacceptable.TLDR; This patch will not be enough to get people to stay playing - return to playing, or even have people enjoy the game.Blizzard needs to do more - change existing system, and release meaningful content that isn’t just doubling down on content people already don’t want to do."
    },
    {
        "thread_name": "I think I'm done with the game",
        "init_post": "I played classic hardcore all the way up to Naxx.I took 10+ years off to start my own business and family.And a few months ago, I had this itch to play again.  And I couldn’t shrug it off for weeks.  And I said myself… “should i?”And then came back in BFA and became a casual player mostly.And while BFA had its moments…There are certainly things to be desired.I felt like I tapped into every aspect of the game (besides raiding) and nothing really thrilled me anymore.Maybe in another 10+ years Ill be back.But for now,I am content on moving on.For the Horde my friends ALWAYS."
    },
    {
        "thread_name": "I was told to \"let the developers know on the forums\" regarding the 25m EoE drop bug",
        "init_post": "Well here I am, hopefully its the right forum.Long story short, I was farming 25m Eye of Eternity for the azure drake like I always do while looking on the wowhead mount comments, found a few comments saying they got it after switching to 10m, I did and two blue drakes dropped in 5 runs, I haven’t seen one in 588 attempts so I got immediately suspicious, after some research I found out that both mounts haven’t drop at all in the last 23000 kills, from december 2018 to July 29 2019 when they fixed it.I made a ticket as well as a bug report on july 25 to explain the situation, hopefully to get it resolved and maybe get some compensation for the 588 attempts I’ve wasted.Every single blizzard representative kept ignoring the problem, explaining to me how RNG work and denying it even existed until you guys fixed it and I pointed the patch notes, the last person told me no compensation is being offered and to “let the developers know on the forum” if I feel something should be given. Not even a sorry for thinking you were an idiot or thanks for helping us get this fix.I’m not the type to complain or ask for compensation normally, but 588 attempts is a LOT and on top of that all my alts have been parked there for the past year preventing me from farming other mounts, I have never been disappointed that much in my WoW career to be honest, farming mounts is all I do and I feel robbed."
    },
    {
        "thread_name": "Retail vs Classic",
        "init_post": "This entire spat over classic and retail reminds me of the franchise wars from Demolition Man. It’s absurd.I should get a badge, or a T-shirt.“I survived the great Classic clash of 2019, and all I got was this.”"
    },
    {
        "thread_name": "Gnomes are food, not friends",
        "init_post": "My new 3D Render!This a comission for a friend, hope you like ot! still not lvl 3 "
    },
    {
        "thread_name": "Blizzard: Do Something Different Next Expansion!",
        "init_post": "Fact:  The current expansion, Battle for Azeroth, is not really a new expansion.  It follows exactly the pattern of the last expansion, Legion.Legion:Level to max, unlock world quests, do emissary quests, with added fun of mission board, mythic plus and raids sprinkled in.  And there are invasions.  No flight.  Months later, get flight and a new zone, with no flight in new zone and new rep to grind etc. in new zone.Battle for Azeroth:Level to max, unlock world quests, do emissary quests, with added fun of mission board, mythic plus and raids sprinkled in. And there are invasions. No Flight.  A year later you get flight, but a new zone with no flight and new rep to grind, etc. in the new zone.Sure, they added in Island expeditions and those biweekly battles, but essentially this is exactly the same as last expansion.  This “expansion” is really just a patch to the last expansion.Blizzard:  With the next expansion follow a new format.Please do not have us hit max level and then do exactly the same thing:  emissary, mission board, invasions, no flight, sprinkling of mythic plus and raids, then a year later get flight and a new flightless zone.Do something original.Your current formula, clearly, does not work.Come up with some new ideas and make something fresh.The players demand it.edit:  And while you are at it, add in some new lore that is not just a rehash of current lore as pointed out by breakbeat in reply number 4 below.edit:  And of course you substitute “Azerite” for “Artifact” and it is the same basic flow.  As per post 24. (Dvis)edit:  As per Knewwshooter in reply 23, it might be 8.3 (not 8.2) that the new no fly zone is added, but again, it is the same exact flow as last expansion."
    },
    {
        "thread_name": "Why does the class wheel keep turning?",
        "init_post": "Every expansion, Blizzard seems to redefine the classes - taking and adding abilities etc. Why do this? It seem like a waste of resources to me.What I would do is find a nice sweet spot in which the majority of the people really like their classes, do my best to balance those classes, then leave it be and focus my resources into generating new content or possibly making new classes. If there is a class that people are really not liking or is underperforming, then they can consider reworking that one class.I don’t get by Blizzard needs to constantly muck around with class abilities. Does anyone here actually enjoy constantly having to relearn their class every expansion?"
    },
    {
        "thread_name": "Method just went 6/8",
        "init_post": "Just watched the fight live, was a blast!  Last 2 percent of the second boss with only 5 players left as the berserk timer kicked in and a kite/dps ending.Yeah yeah, I know no one cares - but it was a great fight. "
    },
    {
        "thread_name": "Blizzard is not prepared",
        "init_post": "…for Classic launch. Just look at how well (ha!) the stress tests have been going. Unable to connect to the server, unable to create a character, massive lag, disconnecting every few seconds. Yes, I know this is what stress tests are for. The Classic hype is real though, with everyone and their brother wanting to try it. Calling it now, launch will be worse then WoD launch."
    },
    {
        "thread_name": "Show Your Pride with New Blood Elf and Dwarf Heritage Armor",
        "init_post": "These armor sets and Tides of Vengeance are almost here!<span class=\"info-number\">0</span><span class=\"info-label\">voters</span>"
    },
    {
        "thread_name": "Please Add Rationale For Patch Notes/Hotfixes",
        "init_post": "Please take a huge step towards communicating effectively and help the player base see things through your eyes by adding rationale for changes."
    },
    {
        "thread_name": "The end of an era... a sad romance story!",
        "init_post": "Once upon a time , I once did enchanting. Me and enchanting did everything together… it was my love and my life. It made me happy and feel powerful in the relationship I had with it…Then came the day BFA released. That was the big turning point in our relationship. He was no longer able to provide the edge and thrill I needed to continue.As blizzard added sangicells, my dear love became even more obsolete. Our love once had a tiny spark again once blizzard announced they would be adding more crafting stuff for sangicells and the newer raid mat for other professions.Then came the day I saw a new thing… I started to think about cheating on my love, with a thing called leatherworking.With the new raid mats able to provide me an edge and give me a thrill, I broke up with enchanting and took leatherworking…I still to this day partially regret doing what I did… but I know leatherworking will always be there to provide for me, when enchanting was unable to…I’m sorry enchanting, maybe one day you will be useful for me!"
    },
    {
        "thread_name": "Flying in wow",
        "init_post": "I cant fly in dreanor our leagon less I do path finder questsand I hate themso I want a gold option in game were I can pay like 10k for dreanor our 15k fr legionand if not I will not pay $35 for bfa and I encourage  others to do the sameif you want our money to buy  bfa then give us something in retrun for once"
    },
    {
        "thread_name": "Im amazed at this patch",
        "init_post": "With all time Blizz had to get this right and they came up with the most tedious boring repetitive rubbish in the history of wow.Man, i’d love to see their meetings and the rationale of the people who thinks this is the right way forward.I have all Sat and I just cant do it. I log on , stand in Mezzamere and wait for the inspiration that doesn’t come.  Then I log off and play Civ 5 deity and win with Spain + Freedom.Alas. So bad. So very bad… /hugs"
    },
    {
        "thread_name": "Azeroth autopilot sided with saurfang",
        "init_post": "I didn’t get to choose Sylvanas. Azeroth autopilot accepted the quest automatically and skipped the decision process. I wanted to kill the traitor Saurfang.Though zappyboi talking about his lightning was funny."
    },
    {
        "thread_name": "Why should I continue to raid?",
        "init_post": "Aside from the obvious answers like raiding with friends, as an example… why should I?In the day and age where we have tools at our disposal like raidbots, simulationcraft, etc, knowing that most players will work towards their best possible stats, azerite traits, etc, and also knowing that you guys over there have the same access to information we do, then why am I scrapping drops that are quite literally 30+ item levels higher than what I have equipped? Why is it that raid armor has again, quite literally, the single worst combination of zaerite choices, yet if I get lucky on WoW’s version of kadala, I can then spend my life farming pearls and upgrading my gear?See, I main am BM hunter. Go head over to iceyveins and look at our current best in slot list compiled by the best theorycrafters in the game. Do you guys find this acceptable? All but a few pieces are upgraded benthic armor, because you’ve made our raid choices so absolutely horrible. We know what works, and so do you. Why give us useless pieces? Why force us into this endless benthic nonsense?If it wasn’t because I love the people I play this game with I’d give it up, because at this point I hate the fact that I am paying for such poor, lazy design."
    },
    {
        "thread_name": "I don't believe in a BiS essence",
        "init_post": "Just as the title says, each one has its perks, but in my opinion they all look viable for whatever role you play. I think it’s more about what you feel you need more of.Take me as an example, I have no problem generating rage, so I wouldn’t go for the essence that helps me generate rage since I’m not really rage starved at any point in time; however crit chance will help me out a lot once I’ve used up my recklessness and siegebreaker, so I will take the Blood of the Enemy Essence. But I only chose Blood because I prefer to pvp more than I do pveing during my downtime, I could’ve easily chosen the essence that pushes spikes that does ticking fire damage and it wouldn’t have really mattered.I think it all depends on playstyle, and I feel that people succumb to the peer pressure of others to be forced into doing content they don’t want to do. While the ordeal is more personal, I feel that people who think there is a specific BiS essence take it too seriously. My suggestion for anyone falling under this pressure is you take it easy, and play the game out the way you want to. If you don’t want to pvp, consider the alternative that best works for you."
    },
    {
        "thread_name": "GLYPHS, we need more GLYPHSSS",
        "init_post": "Seriously, though, like why aren’t there piles of glyphs floating around when they’d be so easy to implement? I just realized how wicked awesome GW is with the Heartsbane Grimoire toy, and it’s a big-time disappointment when it doesn’t work as soon as it’s cancelled once… That would be a wicked-cool glyph to have the option for… But seriously, there are piles of models floating around for damn near every class and spec, we should have options for them all, why not? Roll out a pile of new glyphs, I’m positive everybody would be thrilled about them."
    },
    {
        "thread_name": "Man’ari Eredar Allied Race",
        "init_post": "Man’ari Eredar should join the Horde. They have been a major part of the story and deserve continuity. They have something in common with the Horde, an enemy with their blue Kin and now those Light Bound sycophants. Plus they’re red. What could make them more perfect? If you’re concerned about them being “hostile to everyone”, make a new faction. It’s not like they haven’t done it with everything else.The draw of the Horde in vanilla was they they were the swolliest of the swol but that hasn’t been true since TBC. With the Draenei model exclusive to the Alliance the Horde needs bigger badder barbarians. Make the Horde great again, give us Man’ari Eredar. Let us be the beasts we deserve to be.Alliance got the Blood Elf model, now it’s time for them to reciprocate."
    },
    {
        "thread_name": "Big chunky muscly chest is best thing",
        "init_post": "Greetings my loyal subjects, I’m here to remind the good people of this zoo that having a big chest bring most joy in our hungry eyes.So all players that aren’t playing a race with big meaty chest are missing out big times and should race change to the superior chest race pool.Thanks and have a good day."
    },
    {
        "thread_name": "The reason why I'm leaving this game",
        "init_post": "I have played for years on and off. This game is basically a single player game anymore. I might come back and try wow classic. But everything now can be done playing alone. Set aside some raids. Not worth the fee or the time.It will never be same as it was years ago…And is not worth a monthly fee."
    },
    {
        "thread_name": "Enough is enough",
        "init_post": "Blizzard how could you possibly think that void stone is even an ounce of balanced in pvp? How is it over the past year you’ve clowns have managed to break pvp through 4 different trinkets?Seriously enough is enough. Stop being dumb blizzard. Blues relay this message to who ever is running yalls zoo."
    },
    {
        "thread_name": "Why do Alliance leaders never die?",
        "init_post": "Horde loses leaders left and right. Meanwhile Alliance leaders are immortal with their plot armor and deus ex machina powers."
    },
    {
        "thread_name": "Healers...ever see this?",
        "init_post": "Ran Gnomerigan a while ago as resto shaman…the BEST heals in the game, in my opinion. Never seem to ever have issues when we have a shammy healer when Im tanking or running DPS.And god I love healing with it thru classic up thru MoP.Anyway, that first jump where youre supposed to grab a parachute. I know that sometimes they dont…they just exect the insta-heals when they flat line at the bottom.Well I didnt see any of the DPS or the tank even go near the parachute.I grabbed mine and dove off towards the big gear, as usual.By the time I landed, tankypoo was DOA, splatted flat like a squirrel under a car tire dead. One DPS was near dead and a blob musta killed him before I landed.So tank was dead on impact.One DPS was dead maybe two seconds after he hit.Third DPS was about 10% heath and the fourth was about 30% or so.This was pretty much how it was when I finally landed on the floor.And can you guess who took the blame for the two deaths and the near deaths because four players DIDNT grab a chute? "
    },
    {
        "thread_name": "My biggest hype for classic",
        "init_post": "Now first i have nothing against casuals.  Now thats out of the way.I am most excited to spend the grind time on my character and see other people who play more serious have the best of the best.  I’m excited because end game content will be able to be seen by the ones putting in work.If anyone else remember seen people in ironforge with epics like damn this dude must be good. Or knowing good tanks on the server because how well they did in groups.This is why i’m excited for the game.  Honestly the free loot got old for me."
    },
    {
        "thread_name": "Hey blizzard why not charge for xmogs in store like you do mounts people will by them",
        "init_post": "the title say it all if the was a cool sword xmog in the store id buy it.maybe its time for blizzard to sell in game xmogs in the store before anyone cries they got mounts in the store.you know people would by cosmetic items in the store blizzard."
    },
    {
        "thread_name": "Alliance Players Can Be High Elves Today",
        "init_post": "Because of Volunteer Guard Day, Alliance players can go to Dalaran-Northrend and /salute the Silver Covenant Guardian Mages to become High Elves."
    },
    {
        "thread_name": "Really tired of being Lied to by Blizzard",
        "init_post": "Stop going before your customers and saying shards where horde dominate 20 to 1 are rare. if they’re so rare, why is it that I never seem to find myself in one that isn’t? I want to see you shunting excess horde into empty shards because it’s the only thing you can actually do to fix this problem. don’t give me anymore of this BS of ‘oh horde shards are uncommon’ or ‘oh more horde do wm then alliance’ I literally don’t care. You have an extremely simple and easy solution to this problem, it’s time to ACT on it."
    },
    {
        "thread_name": "Why Doesnt WoW Have Cyrodiil?",
        "init_post": "SO I just tried out ESO for the first time… It has Cyrodiil. Cyrodiil is what WoW is missing in the PvP department… WHy doesnt blizzard make their own version of this? a ever changing, complex, pvp/pve area that involves sieging bases, knocking down castle walls, and claiming territory? It would bring a lot of the PvP players back that left retail for its lack of engaging pvp! (oh and give us back pvp vendors!!)"
    },
    {
        "thread_name": "Zandalari and Kul Tirans pushed back even further?",
        "init_post": "First it was supposed to be sometime after launch.Then after the first content patch.Then 8.1.5, and all you needed was exalted with their respective reps, according to what Ion said in one of the Q&amp;As.Now it’s 8.1.5, Tides of Vengeance war campaign, all questing zones completed for the respective factions, scenarios (for Horde it’s Blood Gate and Zandalar Forever).And if you’re not a raider, you’ll have to wait 'til LFR wings open up, as they’re needed for the final step of the war campaign, so that’s yet another pushback."
    },
    {
        "thread_name": "WoW built and carried the MMO market on its shoulders",
        "init_post": "I see people citing WoW’s decline with excuses such as that the MMO market isn’t there anymore. It wasn’t there pre-WoW. What did people have pre-WoW; everquest? starwars galaxies? They didn’t hold a candle to what WoW became, not even close. If WoW hadn’t come along, the MMO market would’ve just been assumed to be that small. It would’ve been laughable to think there was a subscription MMO that could reach 12 million subs, because it was so unprecedented and so far from the norm. The only reason we know now that those numbers were ever possible is because WoW made it that way, and it wasn’t because there was some MMO market out there in the ether, it was that WoW was just that good that it built the market. It had a strong community that kept people coming back for. It had incentives for improving your character and improving yourself as a player.WoW doesn’t have what it had anymore, so the market it built is dwindling, although FF14 has been doing a decent job at stepping up. Right now, I believe WoW is simply piggybacking off the success of its previous iterations. If modern WoW’s model existed in 2008, I wouldn’t pretend it would reach the peaks it did.At the end of the day, WoW just isn’t really a game that bolsters a loyal fanbase anymore. It could be, but it isn’t."
    },
    {
        "thread_name": "We don’t need more classes",
        "init_post": "We really don’t.  There’s already too many classes in wow that do the same thing.You can’t keeo taking away stuff from specs to make new classes and thing you’ll be able to keep the game balanced."
    },
    {
        "thread_name": "Tauren only meeting",
        "init_post": "With Baine locked up I say we should go to Disney world until BFA is over. The Tauren no longer have a place in the Horde so we might as well enjoy our time off right now."
    },
    {
        "thread_name": "Hey! Where's my purple Lightforged Heritage Armor?!",
        "init_post": "C’mon! We’ve been waiting for these colorations! I want my Lightforged to look pretty in purple! "
    },
    {
        "thread_name": "_______ is Why People Are Leaving",
        "init_post": "I see a lot of these topics.  RNG.  Class design.  This.  That.  The other thing.Truth is, I think, most of us would stay and pay and play if it was REALLY just one issue.  If it was just one big problem but everything else was awesome, most people would be able to find fun in the game.This development team has been wrecking WoW piece by piece for three expansions.  If Blizzard wants to save their flagship game, and the legacy and goodwill attached to it, they truly need to transfer this team to some other project and bring in developers who understand the whole MMORPG experience.  Not just endgame but the whole game.My two cents.  I just think it’s important to say that it really isn’t one problem driving people away.  It’s three expansions full of dumb decisions that have led us to this mess."
    },
    {
        "thread_name": "Night Elves are Entitled Edgelords",
        "init_post": "They’re entitled, They’re generic dull blueberries, The Females are ugly, Tyrande is boring Mary Sue Poppins who is a jerk to Manduin, Their Night Warrior Eyes are ununique plus creepy, They have no White Skin nor Human Options in general, They ruined Alliance Identity of Pure Elves, plus stole the Thalassian Druids from Warcraft 2.I’m glad Nightborne are killing them. They probably should have been an Alliance race if Tyrande wasn’t being racist and entitled. I will blame them if they ruin any chance of original skin elf race into the faction as well. I hope Blizzard removes Night Elves off the Alliance Faction so that Alliance can finally have True Identity as Humans, Dwarves, Gnomes, and Pure White Elves than Blueberries, Grey Dwarves and other edgy entitled stuff."
    },
    {
        "thread_name": "I thought this was an MMO?",
        "init_post": "No seriously, I don’ know about you guys but I just sat in my factions main city for an hour and didn’t see a single soul. The Massively Multiplayer aspect of WoW appears to be broken or to have been changed to Single Player Online.PS I’m not paying you 1k US$ to fix what you broke blizzard. Even if I could. I’m sorry it happened yes. But it is not my fault you made so much money in the past. Apparently you’re not concerned with continued income? This is going to make so many people quit if they did not already."
    },
    {
        "thread_name": "Rares Dying Too Fast",
        "init_post": "People are killing rares as soon as they spawn. They are being extremely selfish. Blizzard, please make it so we can’t interact with the rares for 45 secs after they spawn."
    },
    {
        "thread_name": "Elixir of Tongues mostly being used for harassment in WPVP",
        "init_post": "I’m not sure how Blizzard thought adding this item and not disabling it in War Mode was a good thing. People are mostly using it to scream expletives and harass players of the opposite faction in PvP."
    },
    {
        "thread_name": "Blizz please start on the PreExpansion Event",
        "init_post": "BFA’s pre expansion event was pretty forgettable.    I actually had to ask someone what it was to remember it.   The entire thing felt phoned in at the last minute and it set the tone for the rest of the expansion.    You can do better,  so do better."
    },
    {
        "thread_name": "Mythic Mechagon",
        "init_post": "gotta be frank this Mythic only mechagon BS is just that BS. thought the same during legion with mythic Acrway (think that was it) but it didnt have 2 recipes in that were must have stuff. and this :know the fight or your bad\" crap aint helping.not everyone on this game (and its just a GAME not a life) can play 20~40 hours a week to be up to the elitist standards that is being forced on us now."
    },
    {
        "thread_name": "Biggest navy destroyed by a small group of ally",
        "init_post": "nice writing btw."
    },
    {
        "thread_name": "When will Blizz bend the knee?",
        "init_post": "My prediction for when Blizz bends the knee and starts to listen to player feedback is this coming Tuesday.But any other guesses are welcome!"
    },
    {
        "thread_name": "Blizzard Patch Surprises: Let's Guess!",
        "init_post": "Well, the patch is at hand.  And we have all read the patch notes.   Yes, they have announced they  are taking away are portals and other fun things.  But the real question is what kind of secret, tricksy, un-announced things they will do on the patch.My guesses?Mess up Pet Battles some more: They totally destroyed Pet Leveling last patch, so maybe they will Nerf our favorite pets.  (Hide your Iron Starlet’s and Direbeak Hatchlings!)Secret Nerfs: Maybe they will take away some favorite (remaining) ability.  (Hide your spellbooks and totems!)Mess with old world stuff.  I spend more time doing things in old content than new anymore.  It’s Fun.  Uh-Oh.  I said the F Word!  Blizzard’s fun detectors have been set off by old world content.  Certainly they will mess with it-and of course not tell us.Every patch comes with lots of unannounced  surprises!What are your guesses for the unannounced surprises of the patch?"
    },
    {
        "thread_name": "Classic wow will fail",
        "init_post": "Because BE are not a playable races."
    },
    {
        "thread_name": "Current Opinion on WoW",
        "init_post": "As a player since vanilla I currently find it hard to enjoy my time playing WoW, I’m not making this post to complain. I’m making this post to see if anyone else is feeling this way as well as i can’t be the only one, and if so what new games are you guys playing? I don’t think its worth wasting my time literally trying my hardest to like a game rather then just enjoying it by playing it. It’s just unfortunate that the game went down this path in my opinion. "
    },
    {
        "thread_name": "Let’s Talk About the Night Elf Problem: When Trauma is Used as a Narrative Crutch",
        "init_post": "Author’s Note: I apologize in advance for the length of this post, but I tend to get a bit wordy when I’m feeling contemplative. If you just want to skip ahead to the discussion about the burning of Teldrassil, scroll down to the bolded text that reads “And here’s the part where you might be interested.” The rest is mainly context related to Night Elf lore as a whole.Thank you!————So, it’s a beautiful day outside. Sun is shining, birds are singing, and my pupper sits by my side as I lounge about on my porch. So, I figure it’s a perfect time to talk about some WoW. I mean, when  it a good time to talk about some WoW?So let’s talk about one of my favorite races, and one of the most controversial pieces of BFA’s overall narrative; the Night Elves.Now, as an avid WC3 player I’ve always been in love with this race. The cross between the wood elf and amazonian aesthetics with a dash of celtic druidic folklore made the night elves one of the most enigmatic yet enthralling races to play as.Since then, the Night Elf aesthetic has been more than a little neutered. They no longer use their home field advantage to its fullest potential, sit back feebly and watch as the Horde carves its insignia into the region of Azshara, and when they do get attention, namely in Cataclysm, it is typically centered around their new druid lore, which has been so defanged that the focus has shifted away from levying the savage powers of the wilds against the enemies of nature and more towards preserving the Emerald Dream, which is by far one of the weakest aspects of WoW’s overall lore. For inexplicable reasons, these same druids, originally only the night elves, saw fit to teach their crafts to Horde races, and they did so under the guidance of Malfurion himself.It’s no wonder why the Night Elves have historically been unfavorably compared to the Blood Elves. There is something innately romantic, and heroic, about a race that pulls itself up from its own bootstraps to reclaim a kingdom that was stolen from them by the literal army of the dead. They are impacted by a magical addiction that defines their very biology, and the means of satiating this addiction is scorned by many around them, yet they forge their own path in the world regardless. Eager to take up arms to defend their home and often first into the fray when danger strikes, even when that danger comes from its own former leaders, Blood Elven heroism is not something that has ever been in short supply.So what was the solution to shake the Night Elves from the dreariness of their past lore and bring them up to snuff with the Blood Elves?Well, Legion was a good start at least in that it focused on expanding the more interesting aspects of Night Elven culture. The wardens are innately interesting in that they’re a militaristic police force that should clash with the theocratic nature of night elf society, and in many ways they do, but in many ways they are necessitated by it. Similarly, the demon hunters are outcasts who do what they believe the rest of their people are incapable of doing to achieve victory, and yes, while we still got the dreaded aesthetically-pleasing yet druid-obsessed Val’sharah, it was at least tempered by the Warden and Demon Hunter prominence elsewhere in Legion’s narrative. And then we arrive at Suramar, a perfectly-preserved snapshot of what the Night Elves used to be when they were at the height of aristocratic prominence. Regardless of one’s feelings with the ultimate political allegiance of the Nightborne, they, along with the demon hunters and wardens, were part of spectacular world building that expanded on the best aspects of what makes a night elf a night elf.Legion made night elf lore interesting again. So how would Battle for Azeroth continue the trend?Initially, I welcomed the Night Elf story beats in BFA with open arms. I can’t say I cared much for the implications of Darnassus in lore, but  burning it to the ground at least necessitated that Night Elves play some part in the faction war storyline of BFA. Given the Night Elves’ lackluster participation record prior to Legion, any kind of night elf exposure was good exposure. This culminated in the Darkshore warfront, where the night elves take center stage and we get to see how an almost-exclusively night elf army (with some Gilnean support) would look like in WoW. Archers, huntresses, glaive throwers, dryads, chimaeras; basically everything I loved about them in WC3 was recreated before my eyes, and it was glorious. At one point, I was ready to argue that Legion and BFA did more for Night Elf lore than any other expansion in WoW history. Perhaps in some ways this is true, but now we’re at the point where the writers say “mission accomplished, Night Elves got their revenge,” and the players say “nuh-uh!”And of course, this was the natural outcome of the modern Night Elf story. BFA could not continue the path that Legion began, so in order to keep the Night Elves in the limelight they resorted to one of the most tired of narrative tropes; the nuclear “trauma” button.Narrative trauma is perhaps one of the biggest crutches whenever a writer needs to kickstart the plot or make a character suddenly become interesting. For instance, when an inexperienced writer wants to feature an action-adventure heroine but forgets to give her a personality, it isn’t uncommon for said writer to throw her into the plot by means of a traumatic incident; typically by having her suffer at the hands of malicious men. Now, tropes are not inherently to be avoided, but when mishandled what you get is a paper-thin 1-dimensional character.Ironically, it’s a mistake WoW has already made with two prominent women; Maiev Shadowsong and Jaina Proudmoore. Maiev up to and including Burning Crusade is only ever fixated on capturing “the one who got away” Illidan Stormrage, and the rage she feels for him dictates her entire character. Even she acknowledges that, once she finally kills him, “I feel nothing, I am nothing.” Where does she go from there? Well, Wolfheart decides to make her displace her rage onto the rest of the Night Elf people and turn her into a domestic terrorist hell-bent on genocide, and damn anyone and everyone who gets in her way!The other example is Jaina Proudmoore, who after the bombing of Theramore feels nothing but hatred for the Horde and can only ever talk about dismantling it. Despite Christie Golden’s efforts in the supplementary novels to make Jaina more nuanced in her emotions, the in-game representation of her only ever came across as a one-dimensional warmonger. This fortunately changed when Golden was brought onto WoW’s writing team and Jaina was rehabilitated so that she turned her trauma into an opportunity to find healing and grow from the experience.Seriously. Want an example of when trauma is used well outside of WoW? Go watch John Wick. John is gifted a dog by his wife who dies of an unspecified illness, only for said dog to be killed by the son of a local crime lord. John goes on a path of vengeance to kill the son and avenge the dog, as expected, but in doing so he enters a world of assassins he walked away from years ago, a world he never wanted to return to. The antagonist is not the son, but rather the father, who knows John’s reputation well as an analogue of the boogeyman, and while he has to do everything in his power to protect his son, he also never wanted to incur the wrath of John Wick and has a perverse sort of sympathy for him being dragged away from his life of relative peace. The world John navigates is interesting on its own, but so too are his reactions and interactions with said world’s moving bits.The biggest crime committed by the Teldrassil incident isn’t that it was poorly thought out, it’s that it’s also derivative. In a plotline already heavily influenced by Garrosh Hellscream’s turn as warchief, the Burning of Teldrassil has more than a few similarities to the Scourging of Quel’thalas. Of course, the difference is that the Scourging of Quel’thalas was amazing writing. The Blood Elves regrouped and redefined their entire society because of it, and their worldview shifted appropriately. They did not become one-dimensional seekers of vengeance, but their every action is done with an eye glancing backwards at their history.But with the Night Elves the question on everyone’s mind is “when will they get their vengeance?” And of course that’s the only question, because the Burning of Teldrassil hasn’t been written to facilitate any other question. It’s not a call for Night Elven social reform, it isn’t a dark chapter in a Night Elven story with a clearly defined goal, it’s just something bad that happened that must be avenged. And now certain Night Elven players are so venomous that they express dissatisfaction that Sylvanas kill-stole Lordaeron, or that the Humans led the charge, or that the night elves didn’t outright kill Nathanos, or that the Night Elves didn’t just raze Orgrimmar in response.It won’t. It will just be an expected outcome for an inciting event meant to cause drama more than actual character development. And Tyrande gaining a new power level does not equate to character development, let’s just deal with that here and now. Changing a character’s level from 120 to skull face does not suddenly make them interesting.The question Night Elf players should be asking isn’t “when will we avenge Teldrassil?” It’s “how will what happened to Teldrassil make us better?” And it’s no wonder there isn’t any Night Elf content planned for patch 8.2, because Teldrassil wasn’t ever intended to have long-reaching narrative consequences. It’s just short-term drama designed to achieve short-term relevance, and that relevance began to die for me once I completed my hundredth run of the Darkshore warfront.And  is the problem with using trauma as a narrative crutch. It serves the moment, but never the story."
    },
    {
        "thread_name": "Forums are too negative lately",
        "init_post": "My friend and I were talking and he brought up a good point.I think these forums need more positivity we’re all having fun playing this game why is everyone always complaining about it? If it was so bad why are we all still playing it.Try to remember Blizzard made this game we love and show them some love too"
    },
    {
        "thread_name": "Losing paid time, time gating and class prune",
        "init_post": "I think this is the last straw from Thralls farm for this orc.Time to check out a new game until next expansion.CheersPs buy your own stuff"
    },
    {
        "thread_name": "Orgrim vs Lothar! 3D Render!",
        "init_post": "Orgrim Doomhammer vs Anduin Lothar. Years 2 after the opening of the Dark Portal.Colorized.So, i made a new Render! this time based on a legendary lore combat-So, the issue here is that Doomhammer doesnt have his armor, so i made a custom one, with some tweaks, try to resamble the Orgrim for the Warcraft movie.Blizzard never did a full HD armor Doomhammer for WoD "
    },
    {
        "thread_name": "End Faction wars",
        "init_post": "Stop👏the👏hate👏let👏love👏createe    "
    },
    {
        "thread_name": "Something has spooked one of de brutosaurs, sending it into a panic",
        "init_post": "Dis chaos is de last thing de city needs.  Help de merchents by rescuing de cargo before you get stomped on!"
    },
    {
        "thread_name": "Light Forged: So boring",
        "init_post": "Darlings, I really want to like the light forged but they are boring!!  Limited customization I can deal with  &lt; sips a little   &gt; but the female jokes and /flirt are just not that funny. For the amount of grind I wonder if they were worth it.Are my darlings at blizzard going to add anything to them later on?"
    },
    {
        "thread_name": "The biggest Tauren problem is not even Baine",
        "init_post": "It’s the fact that Baine is only important tauren. From that you can only see that race of long time nomads have NO ambitions at all. No one opposes Baine, no one wants to bring glory to taurens, every cow is just extra pacified.  Like a domesticated cow.Taurens wouldn’t survived if they were like this in wc3 time."
    },
    {
        "thread_name": "Dear Blizzard: Create an LFG for Mythic 0",
        "init_post": "Create a Mythic 0 LFG to make it easier to get into baseline mythics, just to at least get quests done and to experience content.Also, if a M0 LFG group works well, allow them to option to remain as a regular group outside of LFG to do more, higher-keyed Mythics if they so choose.Thank you for coming to my TED talk."
    },
    {
        "thread_name": "Suggestion: Allow us to upgrade our Flight Master's whistle to use in the old world",
        "init_post": "Basically title.Allow us to use our whistle and upgrade it to be used in the old world.It is a very useful item, and would be great to use when farming or when our Hearth is on CD.Also, maybe introduce an heirloom whistle that we can use while leveling new characters.This could cut down on travel time and make leveling an even more smooth experience.Here are my ideas:Honestly this is a small change that I feel could have a large impact.Blizzard please &lt;3edited to add in ideas for unlock/implementation"
    },
    {
        "thread_name": "Account off",
        "init_post": "Pathfinder is a total joke."
    },
    {
        "thread_name": "Bobby kotick doesn't want to make fun games?0",
        "init_post": "So an article came out today that Bobby kotick came out and straight up said they don’t want to make fun games anymore. I want to include the link but the forums won’t let me which is total crap. I think I’m just about done with activision if this is remotely true.Edit: this is weird my title looks in all caps but I didn’t type it in that way."
    },
    {
        "thread_name": "Demon Hunter Love Thread :smiling_imp:",
        "init_post": "Now if only the Illidari were weren’t so nitpicky about their height requirements I’d love them even more. Nothing like a bit of fel magic in morning to make your hair look absolutely fabulous!"
    },
    {
        "thread_name": "No Motivation for HoA Skills",
        "init_post": "It hit me earlier today when I was wondering what the upgraded animation of some of the abilities you get with the Heart of Azeroth would look like at max level.Come 9.0, those abilities are more or less just… gone. We’re not keeping them. (Speculation, mind you, but the track record lends support)I now have no motivation at all to even level them to upgrade them to be more effective. Maybe there will be a little achievement for getting one to it’s highest rank but… I just can’t be bothered to put in the effort to improve something that’ll be gone in a year or so.Anyone else feeling like this?"
    },
    {
        "thread_name": "Elf Only Thread. Come say hi!",
        "init_post": "Blue or Red, any elf is welcomed here. Feel free to discuss our current plans for world domination or just how unfair it is how amazing we look in transmog compared to the…lesser races."
    },
    {
        "thread_name": "I hope we lose at the end of this expansion",
        "init_post": "Think about it guys…it would be a really good twist for the story.You’re in the raid, smashing Azshara’s face in with a giant piece of steel, and suddenly, right on the cusp of victory.You fail.It was all a trick, a trap, empowering you was nothing but entertainment. To watch you flail in defiance, only to be broken.Next patch kicks in, and Azeroth is on the verge of death.  The black empire has newly arisen, and the land is suffering corruption everywhere.  All that you once loved and held dear is either dead, or enslaved and you are part of a small segment left trying to survive.  Not win…survive.The pantheon is gone, the world is seeing its doom on the horizon.SUDDENLY,  MALFURION COMES OUT OF NOWHERE (screw you Tyrande).He slaps Azshara so hard she turns into a squid, then he fries Nzoth to make some delicious fried octopus.The world is saved, the night elves stab Sylvanas in the face, then Nathanos, I want to see him suffer, and then accidentally burn down another one of their trees.  You know…because night elves can’t go more than half a patch without something happening to their damn trees."
    },
    {
        "thread_name": "Personal loot doesn’t really feel like “personal” loot",
        "init_post": "Yes, another thread about this ridiculous system. This isn’t about bringing ML back but about improving PL.I thought PL was suppose to give you more control over what gear you keep and give away but every time I want to give away an item that’s a small 5 ilvl upgrade for me but huge for someone else, the game tells me I can’t do that. The game dictates what I can and can’t give away. Why? If this restriction was removed, people can still keep whatever they want but they can at least give away anything they don’t regardless of ilvl.My guild always trades around gear that would benefit the raid the most. If I have a ring that’s 370 with BiS stats and I get a 390 with worst stats that ends up being a tiny upgrade for me but someone else’s BiS id rather give it to that person.This goes for pugs too. I’ve been in many where I’ve tried to trade gear that’s an ilvl upgrade and small % upgrade for me but a huge upgrade for someone else yet I’m not allowed. The game tells me I can’t.Personal loot honestly feels more restrictive than ML. I don’t care if ML comes back or not but why is a system that’s called personal loot so restrictive? It feels horrible getting a super small upgrade that I can’t give away when it’s huge for someone else. It doesn’t feel like this gear is -mine- at all."
    },
    {
        "thread_name": "Players vs Developers",
        "init_post": "The statement “it’s Blizzard game they can do what they want” is so obtuse it’s become a meme. Of course it’s their game!BUT when they decide to keep implementing  content that players are so adamantly AGAINST, anyway, it’s come to the point that said players quit!Not JUST your random kids but also top name streamers and YouTube channels as well.It’s come to the point I ask myself if the players know what’s better for the game more than the developers.The developers “HEAR us but the just don’t LISTEN”.And I really think that’s the main issue these days. This next major patch is really going to (make or break) this expansion for alot of players. I hope Blizzard follows through."
    },
    {
        "thread_name": "Its time to take the restrictions off of fun transmogs Blizz!",
        "init_post": "For years now Blizzard has added fun cosmetic items into the game, yet they’re always overly restricted so we don’t have too much fun. Here is an example of a fun cosmetic items that has really dumb restrictions tied to it This item has a restriction which only makes it transmoggable during Hallow’s End, and yet…Has the exact same model and IS transmoggable all year around.I just don’t get it, we have many fun items that ARENT tied to dumb restrictions, like the Stinkrot Smasher and the Nobleman’s/Noblewoman’s sets from DMF. So why do TONS of amazing and fun items have restrictions tied to them or are simply not transmoggable at all?Below is a list of many fun items that I as well as many others would LOVE to use in their transmogs but cant due to restrictions.Lord Walden’s Top HatAll Noblegarden CircletsNoblegarden Egg BasketSpring RobesBlack Tuxedo PantsWhite Tuxedo ShirtAll Hallow’s End witch hatsForever Lovely RoseVile Fumigator’s MaskBouquet of Red RosesAll Daggers with a broken bottle appearanceAll Lunar Festival dressesAll Lunar Festival suitsAll Lunar Festival flower crownsBronze Tinted SunglassesRhinestone GlassesAll Winter Veil outfitsWhole Fire Festival setFrying panHigh society Top HatAll monocles except for one (Chief Architect’s Monocle)I’m sure I have missed many more fun items that have the exact same restrictions as the ones listed above, but I cant remember them all lol.Back on the old forums I made a topic called “Please let us mog the amber shades all year around” or something like that, and it got tons of attention and love, so clearly transmogging matters to the players. I would post a link to that old forum topic but I don’t think the old forums even exist anymore Edit: This is the thread  Thanks to Nillah for finding it!Anyway, I don’t know why I made this thread… I probably spent too much time into it even though It will probably get buried under all the other threads. But I just wanted to say that I am tired of fun things getting restricted because “No fun allowed” Let us have fun Blizzard! games are meant to be fun! "
    },
    {
        "thread_name": "6 Months Was Long Enough",
        "init_post": "BFA released 7 months ago. I’ve experienced the content in all BfA zones, participated in Island Expeditions, LFR’s, dungeons, WPvP, Faction Assaults, etc… and I feel flight is long overdue. I’d rather stay immersed while flying my character, than using a whistle or “taxi”. If I could fly, I’d play more often by adding in profession gathering. I’m just burned out on gathering on this toon because I’ve been doing it for 7 months on other toons, by ground.I’m tired of running on my “flying” mounts. This wait is ridiculous."
    },
    {
        "thread_name": "Request: More Death Animations Please",
        "init_post": "Can you please just add death animations that are unique to whatever killed you?  I mean when I kill you with a frostbolt I want you to freeze.  Or an ice lance, i want to see your frozen body shatter.  Every major ability or effect on my bar should have a unique animation.  I think we can all agree that when I land my fatal Hammer of Justice or Starfall for the KB that you’re going out in style.  Divert some of your resources away from making new mounts and give me some Kill Animation Glyphs or something kthx/signed"
    },
    {
        "thread_name": "What Would be the Most Jump-the-Shark Way to End BFA?",
        "init_post": "Here is my submission.After the defeat of Azshara the Horde and the Alliance work feverishly to fortify Thunder Bluff in patch 8.2.5. As they are working they see a figure in the distance. Tall, lithe, four-legged, antlers three times the size of its head.With an insidious laugh he announces your doom. For he is Davidius Doehoof, Deliverer of the Deerforged. Yes, it turns out that when Tyrande empowered the night elves she accidentally got an innocent deer caught up in the ritual.“Oops,” says Tyrande. But she doesn’t really care and just goes back to attempting to punch Nathanos in the face. And failing.His eyes were opened that day to the glory of Elune. He has tried repeatedly to share his pamphlets to the denizens of Thunder Bluff but they have always turned him away.No longer.Now Davidius Doehoof, Deliverer of the Deerforged will  Thunder Bluff to know the glory of his religion. So the Horde and the Alliance team up to take him down in the plains of Mulgore.The battle lasts all of two minutes. It turns out Davidius Doehoof, Deliverer of the Deerforged wasn’t given many actual powers beyond being able to sparkle. But no matter. Davidius Doehoof, Deliverer of the Deerforged, has already completed his insidious ritual with his dying breath.The Horde and the Alliance turn towards the sky and see that the moon now bears the grinning malicious face of Elune. And every second that passes she gets closer. Closer. Closer…Yeah. Like Majora’s Mask.Magni Bronzebeard rips off his beard and screams into his dwarven ale.“Now look what ye done, ye stupids! Ye been fighting each other so long that now the moon wants to kill ye. The blasted moon! How in the hell are we supposed to fight the moon?!?”But wait! You hear and smell the burning of jet fuel. A rocketship lands before you! The doors slowly crank open and a walkway stretches outwards. You hear a growl as a large, scaly creature stomps out.It is Subject Nine! She has come to finally repay the debt she has owed to you ever since you freed her people.“Looks like it’s time…” She says as she puts on some sunglasses, \"for the velocirapture…*And then Subject Nine takes all the Horde and Alliance’s champions in her spaceship and flies them into the moon. 8.3 takes place as a journey to the center of the moon in an effort to just blow the sucker up. They succeed and everyone starts hating Tyrande for invoking ancient powers from an unknown entity that almost destroyed the entire world.Meanwhile, in Orgrimmar, Sylvanas wipes her brow in relief that everyone hates Tyrande now and have completely forgotten about Sylvanas. After all, Sylvanas didn’t really have any plans to win this war; she was just biding time until something big and random happened to divert everyone’s attention.Sylvanas and Saurfang make friendship bracelets as a sign of their forgiveness and Tyrande is exiled from society.And that’s how BFA ends."
    },
    {
        "thread_name": "Bon Appetit, subs",
        "init_post": "So you know how you goto a real fancy (expensive restaurant) that supposedly has the best food ever.All the chief does is make the same greasy food you get at the local pub but makes it smaller.  The thought is if you eat it all it was that good!You decide at dinner that your $50 chicken tender, is better than the chicken tenders you get at Hardee’s for much cheaper.Meet your chef, Blizzard/Activision!  And their specialty, time-gated content!"
    },
    {
        "thread_name": "Gul'dan Was From The Flowerpicker Clan",
        "init_post": "According to Gul’dan’s “Harbingers” video, no one living has ever heard of the village of his birth.Gul’dan’s flashbacks also show the village was located on a desert, likely Gorgrond.Meanwhile, the Flowerpicker Clan is an Orcish Clan that was only named in the WC2 files and never mentioned in-game or in any lore books.Since they are never mentioned, the Flowerpicker clan is a clan that no one in-universe has ever heard of.Now, considering the fact that Gorgrond is home to Draenor’s most dangerous and  flowers and flower people, that’s the most likely location of an Orcish Clan named after picking flowers.So it makes sense that Gul’dan’s clan is actually the Flowerpicker Clan."
    },
    {
        "thread_name": "Kul'tiran unlock chain is absolutely terrible",
        "init_post": "It basically consists of a ton of pointless fetch quests, and flying back and forth over and over again all across Kul’tiras to talk to pointless people.  This looks like it took about 0 dev time, weee."
    },
    {
        "thread_name": "Wrathion is hot",
        "init_post": "His face is gorgeous. Frankly he’s just perfectly my type - he’s got chiseled cheekbones and a smoldering glare that would melt me into a puddle. Just the right amount of well trimmed facial hair, and a messed mane that gives him this confidant and rugged look. That man oozes confidence and surety, and then there’s his body. Of course we can’t see much, but it leaves much to the imagination. Though, we do know he’s got quite the posterior.I’m thinking arms like steel cords, a chest that would have inspired Michelangelo, with rippling abs and prominent hip muscles. Sculpted thighs that could trap your head between them (judging from his combat animations, he wouldn’t have any trouble with that,) and I doubt he’s lacking in any department.He’s like, perfect Goshdarnit. Blizzard needs to either stop making beautiful men or make more of them because I  get enough of them."
    },
    {
        "thread_name": "Rogues didn’t have to be nerfed",
        "init_post": "They weren’t broken. Other Specs were just outdated and have to be buffed / modify to be able to excel in m+Blizzard doesn’t even play their own game and they have no idea what they are doing."
    },
    {
        "thread_name": "Alliance Hall of Shame",
        "init_post": "Horde 100 guilds defeated JainaAlliance 15 guilds  "
    },
    {
        "thread_name": "Don't buy the new Siltwing Albatross mount. It vanishes",
        "init_post": "Just bought the mount with the coins I’ve been saving the past several weeks. 1000 doubloons straight down the toilet. Using the mount consumes it but doesn’t mark as “learned” in the vendor’s UI or appear in the mount journal.Thanks for testing your crap, Blizz.I’d be careful with the new seahorse mount too. I don’t have any coins left to verify if its bugged or not but I wouldn’t take my chances."
    },
    {
        "thread_name": "Blizzcon this year will be ..... interesting",
        "init_post": "I can’t even imagine what Blizzcon will be like this year with the way the communities are feeling right now.If 8.2 (which I have to imagine will be out by then) bombs then the WoW panels will be … something"
    },
    {
        "thread_name": "Old-World Scaling to 120 A discussion!",
        "init_post": "I know this a long shot, but am I the only one that thinks going back to do Razorfen Kraul or Diremaul for some 120 loot about equal to the current dungeon content would be epic?I want to hear opinions on how a change like this could be beneficial and negative to the game if we’re moving toward the future lets go full circle, right now leveling is dead! Give us some truly new epic things to do in the old world! Let us go back adventuring with friends to make some obsecure build. Even if it’s just some sort of trial! Some unique server type! I think that something like that could be amazing!Obviously old-loot would have to be balanced so it’s 120 scaling wasn’t broken! But, still this game can be so much more than just this centralized roller-coaster of expansion to expansion! This world we play in is so much larger than being max level and re-running the same WQ and Mythic+ over and over! I think it’s high time we started thinking outside the box!"
    },
    {
        "thread_name": "This got to Stop!",
        "init_post": "I will not want to join up with alliance. I did not do it in MOP and i will not do it here. I left legion when it became so obvious that we going to be following alliance around like little puppy dogs. That I bailed as soon  as the written on the wall hit me. Sorry not following alliance. I am Horde. Not alliance.It is bad enough you killed off Vol’jin in WOD and Legion. It was really no surprise that he was knife in back. He really did nothing in wod. He is going be rusty after all that time.Then you gave us a war chief that might be interesting. In legion. At first she look interesting. Then poof she gone. Guess what you did it again in BFA. What wrong with you guys. How can she be the bad guy if she not around at all. We only see her for just a few hours that it. What the heck is wrong with that? “Plentiful”Now you you want me to team up with Genn and Jaina. Both who attacked the horde. Like all is forgiven. No way. I did raid to see end. I will not do quest with Genn. He is enemy number 1 in my book. He killed fellow orcs. Then hunted down survivors. Nope he get it from me one day.Stop with this force stuff already. I will not save Baine. I will not help Thrall or Suarfang. They all are treasonous  bunch with no sense of honor. True orcs challenge her and not sneak about. That is not the Honorable orc heritage way. Put this twisted story back on tracks. Stop with the lovey dovey stuff. The story bad enough with only two plot lines. What now there is only be the big bad plot line. That want get boring at all.  "
    },
    {
        "thread_name": "Still not enough Alliance in Warmode",
        "init_post": "Please up the reward to 100%.I tried War mode today due to the increased bonus. I have been trying to do this quest for last 30 mins to kill a single mob for champions of Azzeroth. There is non stop stream of 10 Horde and NO alliance.Im gonna turn WM off again. 30% More azerite is not worth 30 mins wait to kill a single mob."
    },
    {
        "thread_name": "Hottest Warcraft Female Character ever",
        "init_post": "Title said it all. What’s your favorite Hottest Warcraft Female Character Ever.Mine would be:1: Jaina Proudmoore.2: Valeera Sanguinar.3: Alleria Windrunner.4: Shandris Feathermoon.5: Alexstrasza6: Thalryssa.7: Sally Whitemane.8: Vaneesa Vancleef.9: Vereesa Windrunner.10: Taelia.What are your favorites down in the comment section."
    },
    {
        "thread_name": "100% pure paladin beef",
        "init_post": "Let’s see if I can do that as well as a human paladin.Behold my beefy chest! Look upon greatness and bow before your superior."
    },
    {
        "thread_name": "Do you miss buying gear from vendors?",
        "init_post": "I miss vendors. I miss how hard it was to get gear and how it rewarding it felt to finally collect enough currency to buy that one piece of gear you wanted.Do you guys like the loot lottery system that’s in the game right now or would you rather have vendors back?I miss rings having main stats on them.I also miss pvp gear having resilience and giving an edge in pvp. I’m sure a lot of you will say versatility is the same thing and maybe you’re right idk. But pvp doesn’t feel the  best to me right now.It feels to me that the carrot on a stick that was gear is no longer there due to how easy it is to obtain pve gear and how hard it is to obtain the pvp gear you want. I feel like the only grinds in the game right now is AP which feels really bad because you can only do one specific thing to efficently farm it and extremely small rep gains from doing the world quests and the vendor rewards are the only carrot on a stick now.I haven’t bothered hitting exalted for any faction and rep grinds are the worst thing in the game to me and has been bundled with world quests which I cannot seem to force myself to do and seem to loathe. I think I prefer doing group content in a MMO and world quests is a strictly solo thing. I think this is the same reason I hate gearing my alts right now.I can easily get geared out in no time but essences are a time gated grind and most things are locked behind rep walls where the rep you get from doing the quests and zones are limited each day.There’s no alternative path to getting that rep like say running the dungeon in mechagon and getting rep for the rustbolt resistance or do the EP to get ankoan/unshackled rep. It feels like the worst way to time gate progress/rewards.I wish there was pve group content you could do to get rep outside of the boring world quest system."
    },
    {
        "thread_name": "Why bother raiding?",
        "init_post": "Last night, I finally had an evening free to do a little raiding. Got 4 bosses down in EP normal, not a huge feat but it was the first time I’d gotten to raid in years. I thoroughly enjoyed it.I even got myself a swanky new 415 weapon, thanks to judicious use of my re-roll tokens. I was pretty satisfied with myself, my guild, and my new weapon.Then this morning I got the Zandalar emissary that gave me a 415 weapon for 20 minutes of solo work. Not even 12 hours later my latest spoil was spoiled by an emissary quest.If the rewards from raiding are this pointless, why do it? Is this why my guild has a tough time mustering? Have that many people just given up on raiding?I had a great time raiding in MoP and Legion, but this makes me feel like a fool who went raiding and spent resources on reroll tokens when I could have been doing literally anything else.What’s the reasoning here? Is there any?"
    },
    {
        "thread_name": "RP community is awesome",
        "init_post": "I don’t RP in game, but I have started following some RPer’s on twitter. And man, it is pretty fun to get involved with and follow what everyone is doing in Azeroth. You all are awesome! Just wanted to share with others if you’re looking for something different in game, Just create a twitter and link your wow account to share what you’re up to. That is all."
    },
    {
        "thread_name": "Give us Draenei Rogues for once and all",
        "init_post": "I’m not asking for Draenei Druids, or Draenei Warlocks, or Draenei Demon Hunter. I’m asking for something that apparently don’t involve magic, and if there are some magic in the path of the Rogue i’m pretty sure that Draeneis can wield it.Also i’m not asking for something that is not part of the lore. The Rangari have rogues, and Mishka is a Draenei Rogue who is part of the SI:7.You can’t tell me also that Draeneis are too big for being rogues, orcs and trolls are rogues and are equally big or more.Also Draenei Rogues will give a new flavor to the rogue class from a lore perspective, because let be honest, rogues in more races are the scum of their society. But a Draenei never will be a scum bag.Let’s get in mind that when Cataclysm was launched with all the new class-race combos introduced, the Draenei was the ONLY race who get nothing. You are in debt with the Draenei.In legion Gnome Hunters were introduced, without making a masive inpunt of new class-race combos. They can do the same for Draenei Rogues, right?Thanks for reading, and please don’t make any clip-clop joke, or hoof noises jokes in your reply, there were fun long time ago, but now it’s geting old."
    },
    {
        "thread_name": "What’s your ilvl?",
        "init_post": "…Said no-one in vanilla ever, cant wait! "
    }
]
