{
    "threads": [
        {
            "url": "https://us.forums.blizzard.com/en/wow/t/this-grinds-my-gears/151138",
            "thread_name": "This grinds my gears",
            "init_post": "So I runnin around Drustvar catchin up on some quest and knocking out some WQs. As a miner I see’s on me map a tell’tale yeller dot tellin me their be ore in them hills.I leans into my trusty mule, “Buttermilk” and charge up te hill…as I clear the ridge i see’s a Dwarf, not jus a Dwarf but a Paladin likes me self in big troubles. He had gone and pulled some 10 or more bad guys aimin to stops him from gettin that precious ore.His health be gettin low and strugglin to hold his own, I could not jus sit by and let me brother-in-arms be beatin so I charged into the group drop me consecration on the ground and clobbered them with me mug and they turned their attention on me. Nothing like a battlin the evil hellspawn scouring Azeroth, I look back as I fend off the group to tell my weary friend we shall sends the motherless orcs back to their Banshee queen andthe daft Dwarf mined his ore and rode off…",
            "comments": [
                "It’s possible he went for the ore before you and was attacked.  He also likely had no idea you were also a miner.  It was good of you to help though so I hope that event doesn’t deter you in the future.  I do the same for people struggling with a pack.",
                "I’m sorry, but your story made my day. ",
                "Nah it won’t stop me, but sometimes gotta vent…good for te soul. I would of helped even if I hadn’t been a miner.",
                "",
                "Pve happened ",
                "Haaa 11/10 for not only the creative and descriptive story telling, but also your name  good job me Scottish friend",
                "Best thread all day, I nearly spit my coffee all over my comp. Have all my likes.",
                "Haha. Ive encountered similar situations and whilst the other player is fighting I quickly mine the ore and then go back to help. But I only do that because I can’t ever get used to the fact that resource nodes are phased for everyone now. Back in my day it was 1 node for all and whoever got to it first was the only one who got it. The rest had to wait for it to respawn.",
                "10/10 would laugh again",
                "Loved your story! Glad you kept your sense of humor about the incident ",
                "Ahh thank ye lass if you can’t laugh at misery, misery will laugh at ye"
            ]
        },
        {
            "url": "https://us.forums.blizzard.com/en/wow/t/deathwing-never-damaged-zandalar/216576",
            "thread_name": "Deathwing never damaged Zandalar",
            "init_post": "For those who don’t know, Zandalari never skip leg day. If one is to skip leg day, they are thrown off the pyramid.Due to this penalty, there has been a rise in muscular legs throughout Zandalari society, so much so that every single step a Zandalari takes shakes the island ever so slightly. This along with the amount of Zandalari on the island has caused the Zandalari capital to begin sinking.Deathwing never damaged the continent of Zandalar. Leg day did.",
            "comments": [
                "What? ",
                "This is now officially canon. Can’t convince me otherwise.",
                "Fool! Who do you think taught the Zandalari about leg day?It was DEATHWING!",
                "I accept this explanation.  Makes the most sense.  All else is heresy.",
                "Ghuun was just jealous he had no legs.The zandalari laughed at him for being squishy. Now we have blood trolls!",
                "That’s strange because the whole reason the zandalar showed up in MoP was described as their home being destroyed by deathwing’s awakening. That’s what I read anyhow.Now suddenly it’s all good? I really recall this being the case, as the zandalari were looking to the mogu to give them new lands to establish as a home and got slumped on the thunderking’s doorstep instead (that jerk called them trash after we killed their counsel).",
                "As I remember, Zul was the one that predicted that and before anyone could investigate, he sauntered off with the navy.  Meanwhile all that happened was the lower areas got flooded but the city was fine.  But the Zandalari were PO’d.In the end, yes Zandalar got flooded, but it was a minor event.",
                "Thank you for that information my friend",
                "I’m not getting the leg day jokes with zandatrolls.",
                "Deathwing did something to Zandalar but I’m struggling to remember what it was. Nobbel would probably know.",
                "He made it sink. It was originally massive, but Deathwing shook some tectonic plates loose and it began to sink.AKA: Just an excuse to make Zandalar tiny.",
                "Maybe it was Deathwing on leg day?",
                "Lore-wise, Deathwing’s Cataclysm is why Nazmir is a swamp. Prior to the Cataclysm, Nazmir was part of Zuldazar and looked precisely like Zuldazar.",
                "Thanks for the clarification!",
                "Learn something new everyday!"
            ]
        },
        {
            "url": "https://us.forums.blizzard.com/en/wow/t/my-1-reason-for-wanting-classic-and-my-gripe-with-retail/254254",
            "thread_name": "My #1 reason for wanting Classic (and my gripe with retail)",
            "init_post": "ignore the eyeball on my head…only us awakened should see it afterall That is this how my characters face looks on retail.<code>https://i.imgur.com/1jOuDUt.jpg</code>this is how my classic ones face looks like.<code>https://i.imgur.com/DHhsB3h.jpg</code>That is also exactly how i looked before the “models 2.0” were forced on me See that bright happy gnome warlock face in 2nd pic?She was happy to rain death and destruction upon stuff (especially tauren mill guards for…reasons).then look at the 1st pic…the “retail” face…She has a “meh” look now.Gone is any form of a smile.She looks like she hasnt slept in YEARS.Yes, models 2.0 look “better” detail wise, but they also destroyed the original created face/personality. (and before anyone says you can change your looks at barber…no. there are no happy gnome faces anymore. all angry neutral creatures T~T!)p.s. updating them could of been loyal to the original but they changed them for no reason  Then they removed me having option to use og models…why you do this blizz? Is it cause its fun and you cant have that?p.p.s. yes its a small thing in grand scheme of things, but lifes little joys make it good.....also no goblins in classic so I dont have breathe same air as them freaks! (i plan to play retail and classic so i will still be seeing you goblins at times…count yourself blessed v_v)",
            "comments": [
                "I feel like all the gear may be playing an impact.  I’d have to see both with the same gear set.  Or no gear.",
                "from what i see currently, the weapon you have makes you a green blob of energy. ;Din Vanilla they didnt know what they were getting into. by BfA they have seen things… things they can not un see.",
                "They should have both model types to choose from in retail.  We can use non windowed mode, full screen, in classic.  But they botched that in retail.",
                "Your reasons are your own, but frankly if the main reason you want to play a 15 year old version of this game is purely cosmetics would you consider that abnormal for an mmorpg that you likely have spent thousands of hours if not days playing?My big concerns for classic is that people are choosing to play it for very superficial and fleeting reasons, and its causing them to create more realms than they need to accommodate that will soon be wastelands when the numbers bottom out after some months.How long do you plan on sticking around if your primary interest is character model differences?",
                "Except that you can play with anyone from any realm so being on a dead realm is nearly irrelevant. Not to mention you can pay to leave the realm, or level new toons in considerably less than 7 days each if you had to start fresh elsewhere.",
                "Granted but I believe a ton of people just want their servers back instead of all this crz and sharding crap.",
                "They think they do, but they may not when a year in they are on a server and faction that can barely support one raiding guild, because of “nochanges.”",
                "Time will tell but I still find it amusing that you are constantly assuming you know better than individuals in how they should be playing the game.  If someone wants to play classic because of models, who are you to suggest that they shouldn’t?",
                "I am some one who has studied this topic for the better part of the last 3 years and have seen all the trends there are to see.The major issue i am worried about is the influx of players who are playing for superficial reasons that will not lead to long-term success in classic.That type of player didnt exist in 2004 and its going to wreak havoc on the game in the early days.All i ask is make sure you actually want to play classic before you say you do. Its likely going to be more important that you compare gameplay and systems rather than cosmetics.In the end, i wouldnt stop a person from playing. Just am trying to ensure they make a healthy decision, because i have ran into a LOT of people who seem excited for classic without realizing just how much the will have to endure to enjoy it.",
                "Gnomes look infinitely better with the new models. Just find a new face.God, how anyone likes the old models is beyond me. Contrarianism is the only answer I can find.",
                "Just remember to loot every corpse!",
                "Please take this to the classic forums ========&gt;",
                "I had never seen the eye on a gnome. It just looks like a giant axe wound in the middle of your forehead.",
                "----------&gt; it’s that way to the classic forum.",
                "Are you talking about classic yes or noIf yes there is a forum for that. Titled classic discussion.",
                "Doesnt matter. classic discussion goes to classic.",
                "",
                "if you have to ask then you do not need to know as you arent one of the chosen.",
                "HE still talked about retail so yes it does matter",
                "Just gottta argue with green text eh Sabbia?  He’s stating his thoughts nothing more. But green text means he’s dictating?  You crack me up.",
                "They butchered the charm of all the original models.I especially hate the bouncy run animations.I much prefer Classic models. They still look great.",
                "Idc about graphics tbh. I’m just looking forward to playing, completing a dungeon, and getting like a blue level dagger for instance and knowing it’s one of the best items to get for your level and even 5-10 levels aheadAny old rogues remember Meteor Shard? I had gotten dual wield those and it was awesome in BGs. that was BC though, i didn’t play classic or know about WoW till BC",
                "i was half tempted to reroll on classic to remake this pally so he could have his santa beard. BUT!!! no avengers shield ret sucks. clothadin. meh.",
                "visit barber in retail, there are atleast one decent face",
                "I don’t know… I liked my gnome 'til they changed them… then she suddenly looked like she was constipated, about 100 years older and ticked off.   Just plain ugly.",
                "Hey, if you’d played through all the problems in all the expansions, your smile would be gone too.",
                "I mean they both look unhappy to me to be honest. My main reason for wanting classic is I don’t have to be level 110-120 to feel like I’m playing the game.",
                "This is the silliest excuse to go from retail to classic, you ignore like 99.9999999% and are fixed over one really not even relevant issue.You will be back to retail in a few days and blame Blizzard for it",
                "Not seeing any meaningful difference. The classic version isn’t smiling. Neither is the retail version. The classic version isn’t frowning. Neither is the retail version. What’s the problem again?",
                "Imagine looking at a gnome and doing anything but projectile vomiting the contents of your stomach all over the walls",
                "I hate how many of the new models are straight up worse than their old versions, so many of them were badly done, both human models, night elves, and many others.",
                "I eagerly await the feedback once people who never played during Vanilla, play Classic.I’m not saying this is you, OP, but i suspect many of these Classic-bound folks won’t last a month.",
                "entirely possible.There is legit reasons to think so.many ppl did over hype how good vanilla was.so many ppl who arent use to its quirks may not like them.(tbh best retail change over years was making it so hutners couldnt NEED everything.)Also gonna admit it…I am not gonna like the 16 slot bag size limitations &lt;_&lt;"
            ]
        },
        {
            "url": "https://us.forums.blizzard.com/en/wow/t/dragonblight-warfront-to-commemorate-the-memory-of-the-wrathgate-edit/62356",
            "thread_name": "Dragonblight Warfront to commemorate the memory of the Wrathgate *EDIT*",
            "init_post": "<span class=\"bbcode-b\">EDIT: I should mention that this will be a good way to pay respect to the fallen, such as Saurfang’s son, all the Alliance soldiers AND POSSIBLY make the alliance aware of Bolvar’s fate!!!</span><span class=\"bbcode-b\">Let me <span class=\"bbcode-i\">try</span> to make this, short, sweet and very much to the point!</span>First, <span class=\"bbcode-b\">whatever you may feel about Sylvanas or rumors about her involvement in the Wrathgate disaster</span>, the Wrathgate is a very pivital and relevant moment of the game’s past, that truly bring’s us full circle to finishing the largest chapter of the forsaken… Sylvanas and her journey to bring immortality to her and her most devout followers… No not immorality… you cheeky jokesters!<span class=\"bbcode-b\">WHAT COULD MAKE THIS AWESOME?</span><span class=\"bbcode-b\">Memory of Wrathgate Cinematics:</span> Kinda like the “Illidan’s memory” cinematics of the defeat of Illidan from Legion. This Wrathgate fan-made remaster is inspiring: <a href=\"https://www.wowhead.com/news=289427/wrathgate-remastered-fan-film-by-ikedit\" rel=\"nofollow noopener\">https://www.wowhead.com/news=289427/wrathgate-remastered-fan-film-by-ikedit</a><span class=\"bbcode-b\">Dragonblight Zone Revamp:</span> Obviously? Possibly a graphical upgrade to Wintergrasp as an Epic BG with a separate queue of it own?<span class=\"bbcode-b\">Last, but not least. An Epic Quest-line answering an age old argument:</span> Who is REALLY responsible for the slaughter at the Wrathgate… and what more is there to Varimathras’ and his “betrayal”? Could he be eluding to something he knew about the Wrathgate when we fight him in Antoras during Legion?",
            "comments": [
                "This sounds cool as hell, honestly. As a warfront it would be kind of weird, but i’m sure story could be added to make it make some sense as why we would be fighting there.Maybe the undead heritage armour questline could involve the wrathgate too?",
                "Nice idea!",
                "I would enjoy an event like this. +1",
                "Honestly the most crucial lore we could talk about in BFA! We need to close this chapter in a BIG way!LOVE this thought!",
                "Can I please heart this more than once? Please?",
                "As a paladin of the Alliance, I think we have a right to know the secret Tirion kept hidden!",
                "How was this not mentioned?",
                "Can we plague the alliance?",
                "Eh Idea seems pointless to worry about in this content drought expack.",
                "Day two guys, let’s get this page noticed!",
                "It could have the Taunka retake Icemist Village for the Horde, and Alliance could have some other base.",
                "Oh yeah, cool! Hadn’t thought about it. Maybe the Tuskar could go alliance haha. ",
                "Aren’t they Horde?",
                "No? Didn’t think so!",
                "lol this thread died"
            ]
        },
        {
            "url": "https://us.forums.blizzard.com/en/wow/t/zandalari-are-divine/170898",
            "thread_name": "Zandalari are DIVINE!",
            "init_post": "Embrace our perfection. All other races are beneath us.",
            "comments": [
                "Resto druid here, now we’re officially di-vine",
                "Thunderbluff Forevah!!!",
                "Yeah, yeah, I be working on it, mon.",
                "Whats goofy and upright insulting is how some troll can LARP as a paladin/warrior of the light meanwhile KT humans can’t.Thanks Blizz.",
                "your feets are gross, so i rather not be beneath you.",
                "Your walking animation sucks, your sitting animation sucks, and your moonkin form is an abomination.",
                "I can taste the jealousy from here. Sorry that your paladin lore sucks compared to ours.",
                "An’she &gt; RezanKnow your place Zandalari paladins or i will put you in one",
                "Normally I wouldn’t agree with a paladin but I’d have to take the tauren’s side. No reason a meager loa should be compared to THE SUN!",
                "Put us in what kind of place? And why are you trying to steal a quote from Rezan?.. Oh… because you know that a Devilsaur God Crusader is cooler than just the sun!",
                "Yummy please I need more salt my lunch was a little bland.",
                "Hakkar has nothing on Bolvar",
                "Thanks, I think so too",
                "The blood plagues want a word.",
                "They’re nothing special. Upright trolls. Yawn.",
                "Tauren Pallies FTW!",
                "The Terror Turkeys reign supreme",
                "Considering that we walked into Zuldazar and rekt your king, I think you’re just a bit delusional there.However I will admit.Zandalari paladin &gt; Blood Elf paladins by far.",
                "Now is the time. Awaken, my bruddas!",
                "Excuse me? Our feet are sexy!",
                "Zandalar are indeed divine my delectable delight, so much so that the very Light shines within their eyes. They possess a stature beyond compare, tusks more powerful than any Orcs, and legs that know how to walk the walk.I am ready to serve my beautiful masters, forever and always. Your loyal Incubus.",
                "I don’t know, chief. This whole An’she thing or whatever just sounds like a really bootleg version of Elune but in reverse. Then again, Zandalari paladins get their power from “Loa” and Blood Elf paladins got theirs from sucking out an imprisoned Naaru.",
                "Hello lovelies",
                "Only loa i respect is jani.I oddly want too pet em…",
                "Dang I have never seen a Zandalari Druid before. They look awesome… 10/10.  I am with Alliance most of my WoW life.  Kultirans are ugly and fat… oops sorry I am too frank.",
                "See? You can already play a Vampire Elf, just roll a Belf pally! I’m a High Elf and Vampire! Really though, I may not be proud of the things my people have done, but I will honor M’uru’s sacrifice.",
                "Never understood why you guys like to worship the grass, trees, moon, and sun. The Light makes more sense imo.",
                "no only worshipping  the void makes sense.",
                "I don’t know, man. I don’t like the whole idea of tentacles trying to grab at me and Old Gods whispering into my ear. The void seems like a really weird ASMR video.",
                "That’s why the army of the Light must band together and defeat this threat.",
                "Worshiping nature makes more sense to me, because it’s tangible.  You see the sun nourishing the plants, which nourish animals, both of which go into nourishing your people.The Light’s an abstract concept, which is fine, nothing wrong with it.",
                "(puts out a lovely tray of cookies for Trolls and Troll friends )",
                "The Light makes more sense to me because the ideals of respect, tenacity, and compassion fit and cohere well in a warrior culture like those of Stormwind humans.",
                "sets up chili fries let them eat main course first!",
                "You guys sure are getting into that “Supreme racist” Zandalari RP! Way to embrace the story, good for you!",
                "Pretty much this.",
                "How’s that fleet doing?Oooh right…",
                "Bold words for prototype-elves. Why is it that every troll kingdom has almost been universally wrecked by humans?Gurubashi: Tried to have a war against Stormwind, got bodied, only managed to get some villages in Westfall, and lost in their all-out attack on Stormwind.Amani: Got burned into submission by some human magesDrakkari: Exterminated by an undead humanZandalari: Got their king killed by a dashing human rogue, and a furry man.",
                "Sure, take credit for what Arthas did while it’s convenient.Most of the wrecking of trolldom was not done by humans–the war with the Aqir (which a unified troll empire of all tribes broke) saw the troll empire splinter off into separate entities: Amani, Gurubashi, Drakkari, etc, with Zandalari administering highest echelons of troll culture, faith, and law.It wasn’t until Kaldorei came into their own and discovered the Well of Eternity’s magical energy that trolldom was actually beaten back enough that they never truly unified ever again.But go on, keep attributing everything to Human Potential ™",
                "Because they are “Da Wae”?",
                "Don’t deny the truth.",
                "Hah…The silly trolls think their special or something.",
                "I’m leveling up a Zandalari Paladin.I love him.",
                "If Rezan is so cool why is he dead",
                "He’s not. His mortal form perished. His spirit yet lives, and he will return. Otherwise troll paladins would be powerless.",
                "Meh. Zandalari Trolls are nothing more than a particularly loud fad. Pretty much all Trolls are. The posture might help, but basically no one commits to actually playing a Troll full time.Yes, and YOU might be the one rabid Troll Superfan, and threads like these attract them, but taken as a whole…? There are currently more 120 Nightbourne than Zandalari, and they don’t even have the benefit of the paladin class.Trolls are a gimmick. A race for hipsters. Elves are the more popular race on all fronts. There are more Kaldorei than Darkspear. There are more Shaldorei and more Ren’dorei than Zandalari. And there are more Sin’dorei than all of them.Yes, yes, you like the non-slouchy Trolls. It’s an improvement, I’ll give it that. But they’re still Trolls. Their cities still get raided, their leaders still die ingloriously in short order without variation, and trying to be relevant for any measurable period of time still inevitably results in death. If that’s the horse you want to back then fine.Just don’t be surprised when Talanji gets ground up into haggis by 11.2 for daring to step into the limelight.",
                "If An’she is so cool, then why doesn’t she do anything?",
                "Ztroll flesh tastes like mint and salami.",
                "Sorry if I shouldn’t point this out, but… perfect beings can usually use both their eyes.One of your eyes are imperfect technically.",
                "An’she doesn’t need to do anything. Everything is going exactly according to plan.",
                "I never claimed An’she was cool.All of your gods are ultimately meaningless.",
                "If it weren’t for those gods, Orcs wouldn’t even exist.",
                "Nah, you’re Horde. Horde feels wrong to me",
                "You already get to be a Male Human Paladin, why would you possibly want to forgo that perfection for Fat Male Human Paladin?",
                "It feels wrong because you’re wrong.",
                "Well your king sure is “beneath” you right now.",
                "The younger races know not what they say my bruddas.Zandalar forevah!",
                "How did they explain troll paladins?Reason, reason LOOK OVER THERE!/flee?Or did they come up with something that I missed in game?",
                "You’re wrong. If the Horde didn’t feel wrong, Eveara would be a nightborne 9/10",
                "&lt;— The joke &lt;— Your head",
                "JokeMind flay",
                "head scratch you’re an undead. Also the alliance failed to capture, or occupy Dazar. All you accomplished was killing our king who had been on death’s door for awhile. Ultimately paving the way for new leadership. Something we desperately needed.",
                "Darkspear trolls &gt; Zandalar trolls. I like having actual normal eyes and no weird calluses on my skin.Also the hunch looks cooler than the elf ripoff model.",
                "We are not paladins. We are prelates.And OP, Zandalari are perhaps the best race. Unfortunately, due to how shoddy nuBlizz has become, the race is incomplete. But it speaks highly to how awesome they are that they are still in the top for me.",
                "I really like the direction of the modern Horde though. What started with the introduction of the sin’dorei has increased exponentially. You have these ancient, powerful, rich cultures with the most aristocratic bearing to join the Horde - First sin’dorei, then the HM Tauren, the Nightborne, and now Zandalari. I love it.Can’t believe people actually think NB would fit the bore-lliance.",
                "I feel like I am in the ghetto doing charity work when I have to go to the Light’s Sanctum and rub shoulders with paladins. I always make sure my dino poops in the chapel and I don’t pick it up. Yes, I am petty!",
                "Zandalari dont canonically do any of the pre-BfA stuff so your dino poops are relegated to the non-canon litterbox.",
                "Prove it!!!",
                "They really are an amazing race.",
                "Oops, my dino just broke a non-canon statue ",
                "hmmmm and which Loa do you bargain with?",
                "Gonk!I’d dedicate myself to Shirvallah, but she seems rather absent in Zandalar.Hi’reek, though … that hurt.  That hurt a lot.  That cut deep."
            ]
        }
    ]
}